import styled from 'styled-components';
import { useNavigate } from 'react-router-dom';

import useDocumentTitle from '../hooks/useDocumentTitle';
import BackBtnNav from '../components/Templetes/BackBtnNav'

const Eula = () => {
  useDocumentTitle('최종 사용자 라이센스 계약 | 좋아하면 누르는');

  return (
    <>
      <BackBtnNav
        pageTitle='최종 사용자 라이센스 계약'
      ></BackBtnNav>
      <Container>
        <Content>
        이 최종 사용자 라이센스 계약서('EULA')는 사용자와{'<'}당사('(주)S2큐피트S2'){'>'}('https://www.someone-might-like-you.com/'이하 '좋아하면 누르는')은(는) 사이의 법적 계약입니다. 좋아하면 누르는(당사의 '서비스') 및 커뮤니티 회원을 보호하기 위해 본 최종 사용자 사용권 계약에 당사의 서비스 사용에 대해 몇 가지 규칙을 설정해야 합니다. 사용자는 본 계약을 자세히 읽은 후 '좋아하면 누르는' 소프트웨어를 설치하거나 사용해야 합니다. 본 소프트웨어를 설치하거나 사용할 경우 본 EULA의 조항에 구속됨을 동의하는 것입니다. 본 EULA의 조항에 동의하지 않을 경우, 서비스를 이용 할 수 없습니다. {'\n'}{'\n'}

        당사의 서비스 사용{'\n'}
        귀하에게 서비스에 대한 사용권이 부여되었으므로 장치에서 스스로 서비스를 플레이하고 사용할 수 있습니다.{'\n'}{'\n'}

        아래에서 당사는 기타 사항을 수행할 수 있는 제한된 권리도 제공합니다. 하지만 어딘가에서 또는 다른 사용자가 도를 넘으려고 하기 때문에 선을 그을 수 밖에 없습니다.{'\n'}
        귀하가 당사가 만든 것과 관련된 사항을 만들려고 하는 경우 해당 사항은 공식적인 것으로 해석될 수 없으며 본 EULA와 브랜드 및 자산 사용 지침을 준수해야 합니다. 특히 당사가 만든 것을 상업적으로 사용해서는 안 됩니다.{'\n'}
        본 EULA의 조건을 위반하는 경우 당사의 게임을 사용하고 플레이하기 위해 당사가 귀하에 제공하는 사용권 및 권한이 철회될 수 있습니다.{'\n'}{'\n'}

        합리적인 범위 내에서 귀하는 서비스의 스크린샷을 사용하여 원하는 대로 자유롭게 수행할 수 있습니다. "합리적인 범위 내"란 본 EULA에서 특별히 가능하다고 명시되거나 브랜드 및 자산 사용 지침을 통해 허용되거나 귀하와 체결한 특정 계약에서 허용되지 않은 한 귀하가 해당 사항을 상업적 용도로 사용할 수 없거나, 불공정하거나 당사의 권리에 부정적 영향을 미치는 사항을 수행할 수 없음을 의미합니다. 비디오 공유 및 스트리밍 사이트에 서비스의 스크린샷, 사용 영상을 업로드 하는 경우 귀하는 광고를 넣을 수 있습니다. {'\n'}{'\n'}
        필수적인 간단한 규칙은 당사가 특별히 괜찮다고 한 경우가 아니면 당사가 만든 사항을 상업적으로 사용하면 안 됩니다. "공정 사용" 또는 "공정 거래" 원칙에 따르는 등 법률에서 명시적으로 허용하는 경우에도 가능합니다. 단, 귀하에게 적용되는 법률에서 허용하는 범위 내에서만 가능합니다.{'\n'}{'\n'}{'\n'}


        콘텐츠{'\n'}{'\n'}
        귀하가 당사의 서비스에서 또는 당사의 서비스를 통해 어떤 사항을 사용할 수 있도록 하려는 경우 해당 사항은 다른 사용자에게 모욕적이거나 불법적이어서는 안 되며, 정직해야 하며, 귀하가 스스로 작성한 것이어야 합니다. 당사의 서비스를 사용하여 사용할 수 있도록 하는 유형에 대한 일부 예는 다음과 같습니다. 인종 차별적 또는 동성애 비하적 언어가 포함된 게시물, 집단 따돌림이 있거나 트롤링하는 게시물, 모욕적이거나 당사 또는 다른 사용자의 평판에 손해를 끼치는 게시물, 포르노 또는 다른 사용자의 생성물이나 이미지가 포함된 게시물 또는 중재자를 사칭하거나 다른 사용자를 속이거나 착취하는 게시물{'\n'}{'\n'}

        당사의 서비스에서 사용할 수 있도록 하는 콘텐츠도 귀하의 생성물이어야 하며 귀하에게 이를 수행할 권한 또는 법적 권리가 있어야 합니다. 서비스를 통해 다른 사용자의 권리를 침해하는 콘텐츠를 사용할 수 있도록 하지 않아야 하며, 이렇게 하지 않을 것에 동의합니다.{'\n'}{'\n'}

        당사는 자체 판단에 따라 모든 콘텐츠를 내릴 권리가 있습니다. {'\n'}{'\n'}{'\n'}

        책임 및 준거법{'\n'}{'\n'}
        본 EULA의 조건은 서비스에 대해 귀하에게 적용되는 법에 따라 귀하가 보유할 수 있는 법적(성문법) 권리에 영향을 주지 않습니다. 귀하에게 적용되는 법에서 배제될 수 없다고 표시된 특정 권리를 보유할 수 있습니다. 본 조건에 명시된 어떤 사항도 이러한 법적 권리에 영향을 주지 않습니다. 이는 귀하의 법적 권리와 모순된 것과 같이 들릴 수 있습니다. "관련 법률에 의거"라고 말하는 경우에는 이것을 의미하는 것입니다.{'\n'}{'\n'}
        
        **국제사법 원칙에 관계없이 본 EULA의 해석 및 위반으로 인한 청구에는 대한민국의 법률이 적용됩니다. 국제사법 원칙에 관계없이 기타 모든 청구와 분쟁(소비자 보호, 불공정거래 및 불법 행위와 당사의 서비스나 웹 사이트와 관련된 분쟁 포함)에는 귀하가 거주하고 있는 국가의 법이 적용됩니다.{'\n'}{'\n'}{'\n'}

        해지{'\n'}{'\n'}
        귀하가 조건을 위반하는 경우 당사는 원하는 대로 본 EULA를 해지할 수 있습니다. 귀하도 언제든지 이를 해지할 수 있습니다. 기기에서 서비스를 제거하기만 하면 EULA가 해지됩니다. EULA가 해지되면 귀하는 본 사용권에서 제공된 서비스에 대한 권리를 더 이상 보유하지 않게 됩니다. 물론 서비스를 통해 스스로 만든 사항에 대한 권리는 여전히 보유합니다. "당사의 책임" 및 "일반 항목"에 대한 단락은 EULA가 해지된 후에도 계속 적용됩니다.{'\n'}{'\n'}{'\n'}

        일반항목{'\n'}{'\n'}
        귀하가 거주하는 지역의 법률에서 본 EULA가 변경할 수 없는 권리를 제공할 수 있습니다. 이러한 경우 해당 법률이 허용하는 한 본 EULA가 적용됩니다. 본 사용권의 어떤 사항도 당사의 과실 또는 기망적 허위진술로 인한 사망이나 신체적 부상에 대한 당사의 책임을 제한하지 않습니다.{'\n'}{'\n'}
         
        당사의 서비스, 관례 또는 법적 의무가 변경되는 등 사유가 있는 경우 때때로 본 EULA를 변경할 수 있습니다. 하지만 해당 변경 사항은 법적으로 적용될 수 있는 범위에서만 효력이 발생합니다. 예를 들어 당사가 제공하는 업데이트를 사용하지 않는 경우에는 기존 EULA가 적용됩니다. 하지만 업데이트를 사용하거나 당사가 제공하는 지속적인 온라인 서비스에 의존하는 서비스의 일부를 사용하는 경우에는 새 EULA가 적용됩니다. 이러한 경우 효력이 발생하기 전에 당사는 웹 사이트에 통지를 게시하거나 기타 합리적인 방법으로 귀하에게 변경 사항을 알립니다. 당사는 이에 대해 불공정하게 되지 않지만 경우에 따라 법률이 변경되거나 어떤 사용자가 서비스의 다른 사용자에게 영향을 미치는 작업을 수행하므로 이를 비밀로 해야 합니다.{'\n'}{'\n'}
        웹 사이트나 서비스에 대한 제안을 제공하는 경우 해당 제안은 무료로 수행되며, 당사는 제안을 수락하거나 고려할 의무가 없습니다. 즉, 당사가 원하는 방식으로 제안을 사용하거나 사용하지 않을 수 있으며 제안에 대해 지급할 필요가 없습니다. 당사가 지급할 만한 제안이 있다고 판단하는 경우, 먼저 지급을 원한다고 당사에 말하고 당사가 제안을 제출하도록 요구하는 것을 서면으로 응답할 때까지 제안을 제출하지 마십시오.{'\n'}{'\n'}{'\n'}
        </Content>
      </Container>
    </>
  );
};

const Container = styled.div`
  display: flex;
  flex-direction: column;
  height: 100%;
  margin: 3rem 2rem;
  height: calc(var(--vh, 1vh) * 95);
`;

const Content = styled.p`
  overflow-y:scroll;
  color: white;
  white-space: pre-line;
  font-size: 15px;
  font-weight: 300;
  line-height: 1.5;
  height: calc(var(--vh, 1vh) * 95);
`;

export default Eula;
